Tekla Open API Reference for Tekla Structures 2025
InputObjectTypeAttribute Constructor
Overload List
Name | Description
InputObjectTypeAttribute(Int32)
 The custom attribute [InputObjectType()] uses this to store the input object type to the system. This is not to be used by itself.
InputObjectTypeAttribute(ConnectionBase.InputObjectType)
 The custom attribute [InputObjectType()] uses this to store the input object type to the system. This is not to be used by itself.
Top
See Also
Reference
InputObjectTypeAttribute Class
Tekla.Structures.Plugins Namespace